Autodesk.Revit.UI.IExternalResourceUIServer.HandleBrowseResult(Autodesk.Revit.DB.ExternalResourceUIBrowseResultType,System.String)
Implement this method to handle results from browsing external resources
in the UI. It is recommended that the server only respond in the case of a critical error.
Remarks:
This method will be called automatically when the user browses for external resources,
such as listing folders and resources of an external server or a subfolder,
or choosing an external resource in the add resource dialog.
resultType:
The result of the browsing operation.
browsingItemPath:
The absolute path of the current item being browsed.
Since:
2015

Autodesk.Revit.UI.IExternalResourceUIServer.HandleLoadResourceResults(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ExternalResourceLoadData})
Implement this method to display any UI related to messages or errors that result when the DB server
associated with this UI server attempts to load an external resource.
Remarks:
This method will be called automatically by Revit after the external resource load process is complete.
Note that automatic loads can occur in the context of other operations such as opening a file.
During automatic loads, it is therefore recommended that the server only display UI that is critical
for the user to see (such as error message).
The loading operation type is Explicit when the user is specifically trying to reload the resource.
During explicit loads, it may be desirable to provide more feedback to the user, such as specific feedback
that the load operation succeeded.
The loading operation type can be accessed through Autodesk.Revit.DB.ExternalResourceLoadContext.
Note that providing messages and other UI feedback for Revit links is more complicated,
because links can be nested.  The UI server may wish to provide different messages and take
different actions, depending on whether a link loaded from the DB server was a "top-level" link,
or was nested.  For example, while it may be possible to correct an error that occurred with a
top-level link by loading it directly, this cannot be done with a nested link, as Revit will throw
an exception.
To complicate things further, the same Revit document may appear more than once in a tree of nested
links, and the UI server should avoid repeatedly posting the same message for instances of that
document.
To help UI servers handle situations where a nested tree of links is loaded:
Each UI server whose DB server loaded one or more links in the tree will only be called once.The collection of ExternalResourceLoadData objects passed into this method will include
only those for links loaded by this server's DB server.The LinkLoadResults object contained in all ExternalResourceLoadData objects will always
be the results for the top-level link, even if the top-level link was not loaded by this
server's DB server.  The LinkLoadResults class contains methods for navigating the full tree of
load results (starting with the top node), so the UI server will be able to determine the complete
context in which one of its DB server's resources was loaded.Servers should only report results for their own link, whether they are nested or not.
document:
The document into which resources were loaded.
loadData:
A collection of ExternalResourceLoadData objects containing information about an attempt to load one or more
external resources,
including:
the load request Idthe type of resource that was loadedinformation to identify the particular resource that was loadedthe actual content obtained during the load attemptthe context of the load operations, e.g. LoadOperationType::Explicit for an explicit loading, LoadOperationType::Automatic for an automatic loadinga settable property indicating whether the server reported any errors for the resourceThe ExternalResourceLoadData contains a property, ErrorsReported, which the server can
use to indicate whether it handled any errors for the resource. For Revit links specifically, Revit will check this value to see
if it should report errors about a given link in the Unresolved
References dialog. An IExternalResourceUIServer can set this value
to true to avoid redundant messages.Note that it is possible for Revit to encounter errors internally
even if the server successfully provides a reference. In general, this
value should only be set to true if the server has reported an
error condition.
Since:
2015

Autodesk.Revit.UI.IExternalResourceUIServer.GetDBServerId
Implement this method to return the id of the server which is associated with this UI server.
Remarks:
If there's no DB server associated with this UI server, an empty GUID value will be returned.
Returns:
The id of the associated DB server.
Since:
2015

Autodesk.Revit.UI.IExternalResourceUIServer
The interface used to provide custom handling of UI operations related to external resources.
Remarks:
IExternalResourceUIServer is the UI server associated with IExternalResourceServer.
IExternalResourceServer provides an interface for loading an external resource (such as a Revit
link or the keynote data) from a source outside of Revit. IExternalResourceUIServer provides
an interface for displaying the results of such an operation to the Revit user.
IExternalResourceUIServers must be associated with an IExternalResourceServer in order
to display any UI. Implement Autodesk.Revit.UI.IExternalResourceUIServer.GetDBServerId to declare a relationship
between an IExternalResourceUIServer and an IExternalResourceServer.
The primary method in IExternalResourceUIServer is Autodesk.Revit.UI.IExternalResourceUIServer.HandleLoadResourceResults(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{Autodesk.Revit.DB.ExternalResourceLoadData}).
After an IExternalResourceServer loads an external resource, Revit will call
HandleLoadResourceResults() on the IExternalResourceUIServer, so that it may display any
related UI. Revit will provide an ExternalResourceLoadData to the UI server, which will
contain information about the resource which was loaded, information about the context of
the load operation, and any Revit-side errors.
The ExternalResourceLoadData passed to HandleLoadResourceResults will also contain a GUID
to uniquely identify the load request. This identifier can help IExternalResourceUIServers
query their IExternalResourceServers for additional information about errors that occurred
during specific load operations. Particularly, the IExternalResourceUIServer may wish to
ask the IExternalResourceServer about errors which Revit is not aware of. For example,
if the IExternalResourceServer includes a website and the user is not logged in, Revit
will not have any information about this error.
Since:
2015